<%-- 
    Document   : frmOfabout
    Created on : May 23, 2013, 1:14:25 AM
    Author     : Note
--%>

<%@page contentType="text/html" pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
    <head>
        <link rel="icon" type="image/x-icon" href="">
        <meta http-equiv="X-UA-Compatible" content="IE=8" />
        <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
        <title>หลักสูตรวิทยาการคอมพิวเตอร์ มหาวิทยาลัยราชภัฏสวนดุสิต ศูนย์การเรียนรางน้ำ</title>
        <script type="text/javascript" src="js/showcontent.js"></script>
        <link rel="stylesheet" href="css/about.css" type="text/css" media="all"/>
    </head>
    <body>
        <div data-role="page">
            <jsp:include page="jsp/header.jsp"/>
            <div data-role="content"> 
                <div class="frmabout">
                    <div class="headabout"></div>
                    <div class="detailabout">ศูนย์การเรียนรางน้ำเริ่มเปิดดำเนินการเมื่อวันที่ 3 กรกฎาคม 2549 โดยมีการโอนย้าย นักศึกษาภาคปกติ 3 หลักสูตรคือ หลักสูตรวิทยาการคอมพิวเตอร์ หลักสูตรบริหารธุรกิจ และหลักสูตรเทคโนโลยีสารสนเทศ จากศูนย์การศึกษาพาณิชยการสยามมาเรียนที่ศูนย์ รางน้ำ มีจำนวนทั้งสิ้น 1,443 คน สำหรับอาจารย์และบุคลากรอื่นๆ ได้โอนย้ายมาจาก ศูนย์พาณิชยการสยามเช่นเดียวกัน ปัจจุบันศูนย์การเรียนรางน้ำได้รับมอบหมายให้ผลิตบัณฑิต ภาคปกติ 2 หลักสูตรคือ หลักสูตรวิทยาการคอมพิวเตอร์ ระดับปริญญาตรี และหลักสูตร การบริหารธุรกิจ แขนงคอมพิวเตอร์ธุรกิจ ระดับปริญญาตรี (หลักสูตรต่อเนื่อง) โดยมีรองศาสตราจารย์สุภา ศีลสร ดำรงตำแหน่งเป็นผู้อำนวยการประจำศูนย์</div>
                </div>
                <div class="frmvision">
                    <div class="headvision"></div>
                    <div class="detailvision">
                        <span class="bold">ปรัชญา</span><br/>
                        วิชาการโดดเด่น  เน้นเทคโนโลยี มีคุณธรรม นำชุมชนเข้มแข็ง <br/><br/>

                        <span class="bold">วิสัยทัศน์</span><br/>
                        ศูนย์การเรียนรางน้ำ  เป็นศูนย์การศึกษาที่เน้นการนำเทคโนโลยีสารสนเทศมาใช้ในการผลิตบัณฑิตให้มีความเป็นเลิศทางวิชาการ  ปลูกฝังให้บัณฑิตมีคุณธรรมและจริยธรรมในการดำรงชีวิตเพื่อตอบสนองความต้องการของชุมชนและประเทศ<br/><br/>


                        <span class="bold">พันธกิจ</span><br/>
                        1. พัฒนาบุคลากรทั้งในส่วนอาจารย์และเจ้าหน้าที่ ให้มีคุณภาพทัดเทียมกับบุคลากร   ในสถาบันการศึกษาระดับอุดมศึกษาชั้นนำ  ของประเทศ<br/>
                        2. ส่งเสริมให้อาจารย์ทำการวิจัยและพัฒนานวัตกรรม เพื่อสร้างองค์ความรู้นำไปประยุกต์ใช้ในการจัดการเรียนการสอน<br/>
                        3. พัฒนาคุณภาพนักศึกษาโดยนำเทคโนโลยีสารสนเทศมาใช้ในการเรียนการสอน การฝึกอบรม และการจัดกิจกรรมอย่างต่อเนื่อง<br/>
                        4. สนับสนุนการจัดโครงการให้บริการวิชาการแก่ชุมชนและสังคม<br/>
                        5. ปลูกฝังให้นักศึกษาร่วมอนุรักษ์ เผยแพร่ศิลปวัฒนธรรม และสืบสานประเพณีไทย<br/><br/>
                        <span class="bold">ประเด็นยุทธศาสตร์</span><br/>
                        1. นำเทคโนโลยีสารสนเทศ มาใช้ในการผลิตบัณฑิตและการบริหารงานของศูนย์ฯ<br/>
                        2. พัฒนาคุณภาพการเรียนการสอนโดยสร้างองค์ความรู้   ด้วยการวิจัยและพัฒนานวัตกรรม<br/>
                        3. สร้างคุณธรรม จริยธรรม และความมีวินัยในตนเองให้แก่บุคลากรและนักศึกษาของศูนย์การศึกษา<br/>
                        4. สนับสนุนและส่งเสริมกิจกรรมในการสืบสานประเพณีและวัฒนธรรม<br/>
                        5. สนับสนุนการบริการวิชาการสู่ชุมชนและสังคม<br/><br/>
                        <span class="bold">เป้าประสงค์</span><br/>
                        1. มีการนำเอาเทคโนโลยีสารสนเทศที่เกี่ยวข้องมาประยุกต์ใช้ในการเรียนการสอนในทุก ๆ หลักสูตรที่จัดการเรียนการสอน  และใช้ในการบริหารจัดการศูนย์การเรียนรางน้ำ<br/>
                        2. ส่งเสริมและสนับสนุนให้บุคลากรของศูนย์ และนักศึกษาได้จัดทำการวิจัย  การพัฒนานวัตกรรม  และงานสร้างสรรค์<br/>
                        3. ศูนย์ฯ มีกิจกรรมที่เกี่ยวข้องกับการสร้างคุณธรรม  จริยธรรม  และความมีวินัยในตนเอง  ให้แก่บุคลากรและนักศึกษา<br/>
                        4. ศูนย์ฯ มีกิจกรรมที่เกี่ยวข้องกับการทำนุบำรุงศิลปวัฒนธรรม อย่างต่อเนื่อง<br/>
                        5. บุคลากรของศูนย์ฯ   สามารถตอบสนองความต้องการพัฒนา   และเสริมสร้างความเข้มแข็งของสังคม  ชุมชน  ประเทศชาติ  และ นานาชาติ<br/><br/>
                        <span class="bold">กลยุทธ์</span><br/>
                        1. พัฒนาอาจารย์ให้มุ่งสร้างองค์ความรู้ด้วยการวิจัยและนำผลการวิจัยไปใช้ใน   สาขาวิชาที่จัดให้มีการเรียนการสอน  ในศูนย์การเรียนรางน้ำ<br/>
                        2. พัฒนาองค์ความรู้ทางด้านวิชาการแก่อาจารย์เพื่อให้เกิดความเชี่ยวชาญที่เป็นเลิศทางวิชาการ<br/>
                        3. สนับสนุนการจัดการเรียนการสอนด้วยอุปกรณ์ที่ทันสมัย<br/>
                        4. ผลิตบัณฑิตโดยเน้นเทคโนโลยีสารสนเทศ  ที่สอดคล้องกับความต้องการของประเทศ<br/>
                        5. พัฒนาสมรรถนะของบุคลากรของศูนย์ฯ  เพื่อเพิ่มประสิทธิภาพในการปฏิบัติงานให้ สอดคล้องกับภารกิจของศูนย์ฯ<br/>
                        6. ฝึกอบรมบุคลากรและนักศึกษาของศูนย์ให้มีคุณธรรม จริยธรรม ทั้งการประกอบอาชีพ และการ ดำรงชีวิตในสังคม<br/>
                        7. จัดกิจกรรมด้านศิลปวัฒนธรรม และการอนุรักษ์ศิลปะ  วัฒนธรรมไทย<br/>
                        8. มีกิจกรรมการบริการวิชาการสู่ชุมชนและสังคมที่หลากหลาย</div><br/>
                </div>
            </div>
            <jsp:include page="jsp/footer.jsp" />
        </div>
        <br/>
    </body>
</html>
