<%-- 
    Document   : frmOfabout
    Created on : May 23, 2013, 1:14:25 AM
    Author     : Note
--%>

<%@page contentType="text/html" pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
    <head>
        <link rel="shortcut icon" href="images/icon.png">
        <meta http-equiv="X-UA-Compatible" content="IE=9" />
        <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
        <title>หลักสูตรวิทยาการคอมพิวเตอร์ มหาวิทยาลัยราชภัฏสวนดุสิต ศูนย์การเรียนรางน้ำ</title>
        <script type="text/javascript" src="js/about.js"></script>
    </head>
    <body>
        <div data-role="page">
            <jsp:include page="jsp/header.jsp"/>
            <div data-role="content"> 
                <div class="ui-grid-a column">
                    <div class="ui-block-a column"><div class="frmabout">
                            <div class="headabout"></div>
                            <div class="detailabout">หลักสูตรวิทยาการคอมพิวเตอร์ สังกัดคณะวิทยาศาสตร์และเทคโนโลยี มหาวิทยาลัยราชภัฏสวนดุสิต ได้เริ่มดำเนินการเรียนการสอนครั้งแรกในปี พ.ศ.2530 ในระดับปริญญาตรี หลักสูตร 4 ปี (ภาษาไทย) ปัจจุบันหลักสูตรวิทยาการคอมพิวเตอร์ได้แบ่งออกเป็น 2 กลุ่มวิชาดังนี้ 1. กลุ่มวิชาเทคโนโลยีเครือข่ายและสื่อผสม 2. กลุ่มวิชาเทคโนโลยีฐานข้อมูลและเว็บแอพพลิเคชั่น โดยในแต่ละกลุ่มจะเน้นสอนและวิจัยเฉพาะทางตามเทคโนโลยีของแต่ละกลุ่ม นอกจากนี้ปัจุบันหลักสูตรได้ทำความร่วมมือกับบริษัทที่มีชื่อเสียงทางด้านเทคโนโลยีคอมพิวเตอร์เช่น Microsoft, Cisco, Oracle เป็นต้น และหลักสูตรได้มีห้องทดลองเฉพาะด้านดังนี้ High Performance Computing and Networking (HPCNET), Intelligent Systems และMultimedia Systems</div>
                        </div>
                        <div class="frmvision">
                            <div class="headvision"></div>
                            <div class="detailvision">
                                <span class="bold">ปรัชญาและความสำคัญ</span><br/>
                                <dd>ผลิตบัณฑิตที่มีคุณธรรม จริยธรรม ที่เป็นผู้สร้างและผู้ใช้เทคโนโลยีคอมพิวเตอร์ โดยมีจุดเด่น</dd>
                                ทางด้านเทคโนโลยีเครือข่าย ซอฟต์แวร์และฐานข้อมูล พร้อมสร้างสรรค์งานด้านคอมพิวเตอร์อย่างเป็นระบบ <br/><br/>

                                <span class="bold">วิสัยทัศน์</span><br/>
                                <dd>เป็นหลักสูตรที่เน้นการเรียนการสอนและวิจัยที่โดดเด่นทางด้านเทคโนโลยีคอมพิวเตอร์</dd><br/>

                                <span class="bold">ประเด็นยุทธศาสตร์</span><br/>
                                <ol>
                                    <li>พัฒนาคุณภาพการเรียนการสอนโดยสร้างองค์ความรู้ใหม่ ด้วยการวิจัยและพัฒนานวัตกรรมใหม่ทางด้านเทคโนโลยีคอมพิวเตอร์</li>
                                    <li>สร้างคุณธรรม จริยธรรม และความมีวินัยในตนเองให้แก่บุคลากรและนักศึกษาหลักสูตรวิทยาการคอมพิวเตอร์</li>
                                    <li>สนับสนุนและส่งเสริมกิจกรรมในการสืบสานประเพณีและวัฒนธรรม</li>
                                    <li>สนับสนุนการบริการวิชาการสู่ชุมชนและสังคม</li>
                                </ol><br/>
                                <span class="bold">กลยุทธ์</span><br/>
                                <ol>
                                    <li>พัฒนาอาจารย์ให้มุ่งสร้างองค์ความรู้ด้วยการวิจัยและนำผลการวิจัยไปใช้ใน สาขาวิชาที่จัดให้มีการเรียนการสอน</li>
                                    <li>พัฒนาองค์ความรู้ทางด้านวิชาการแก่อาจารย์เพื่อให้เกิดความเชี่ยวชาญที่เป็นเลิศทางวิชาการ</li>
                                    <li>สนับสนุนการจัดการเรียนการสอนด้วยอุปกรณ์ที่ทันสมัย</li>
                                    <li>ผลิตบัณฑิตโดยเน้นเทคโนโลยีคอมพิวเตอร์ ที่สอดคล้องกับความต้องการของประเทศ</li>
                                    <li>พัฒนาสมรรถนะของบุคลากรของศูนย์ฯ เพื่อเพิ่มประสิทธิภาพในการปฏิบัติงานให้ สอดคล้องกับภารกิจของศูนย์ฯ</li>
                                    <li>ฝึกอบรมบุคลากรและนักศึกษาของหลักสูตรให้มีคุณธรรม จริยธรรม ทั้งการประกอบอาชีพ และการ ดำรงชีวิตในสังคม</li>
                                    <li>จัดกิจกรรมด้านศิลปวัฒนธรรม และการอนุรักษ์ศิลปะ วัฒนธรรมไทย</li>
                                    <li>มีกิจกรรมการบริการวิชาการสู่ชุมชนและสังคมที่หลากหลาย</li>
                                </ol>
                            </div>
                        </div>
                    </div>
                    <div class="ui-block-b column"><jsp:include page="jsp/columnRight.jsp" /></div>
                </div>
            </div>
            <jsp:include page="jsp/footer.jsp" />
        </div>
        <br/>
    </body>
</html>
